src/main/resources/user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://com.reyyencuneyt.task4/SOAP">
    <soapenv:Header/>
    <soapenv:Body>
        <us:getUserRequest>
            <us:name>reyyen</us:name>
        </us:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>